---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelNodesMark
source: html/c8f5c84b-e82c-ee77-6509-5ebae396a426.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelNodesMark Property

"Node Number": Used for nodes

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelNodesMark { get; }
```